{
    "title": "Getting started with IBM Cloud docs",
    "lastupdated": "2021-05-12",
    "introduction": "The platform is built to support your needs whether it's working only in the public cloud or taking advantage of a multicloud deployment model. Leverage the docs, API & SDK reference, architecture references, and more to support your app development needs.",
    "section_devtools": {
      "api": "/docs?tab=api-docs&category=platform_services",
      "cli": "/docs?tab=develop",
      "terraform": "https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs"
    },
    "section_recommended": [
      {
        "title": "What's included in the platform?",
        "description": "The platform consists of a network of interrelated components that work together to provide a consistent and dependable cloud experience to support your app development needs.",
        "href": "/docs/overview?topic=overview-whatis-platform#built-into-platform"
      },
      {
        "title": "Try out IBM Cloud, for free",
        "description": "Get up and running quickly by setting up a Lite account with this short tutorial.",
        "href": "/docs/overview?topic=overview-quickstart_lite"
      },
      {
        "title": "Service and infrastructure by location",
        "description": "Check out the regions and data centers that IBM Cloud products are available.",
        "href": "/docs/overview?topic=overview-services_region"
      }
    ],
    "section_videos": [
      {
        "title": "Learn how to navigate through the IBM Cloud console",
        "href": "/docs/overview?topic=overview-ui#video-ui",
        "thumbnail": "/images/welcome-thumbnail.png"
      }
    ],
    "section_learn": {
      "developer": "https://developer.ibm.com/depmodels/cloud/",
      "architecture": "https://www.ibm.com/cloud/architecture",
      "training": "https://www.ibm.com/training/cloud",
      "community": "https://community.ibm.com/community/user/publiccloud/home"
    },
    "section_updates": {
      "view_more": "/docs/overview?topic=overview-whatsnew",
      "tiles": [
        {
          "date": "21 April 2021",
          "title": "Delivering notifications by using webhooks",
          "description": "You can now easily add webhooks to the notification distribution list in addition to adding email addresses. You can register a webhook with your account on the Notification distribution list page to receive all account notifications."
        },
        {
          "date": "19 April 2021",
          "title": "Upcoming changes to the user invitation flow",
          "description": "From June 1, 2021 to enhance security and user protection, IBM Cloud will require all users to accept an invitation in order to become an active user within a new account. After this change, users will need to accept an invitation in their notifications, by email, or by using the CLI to onboard to a new account. Concerned about how this change will impact your automation? To avoid any disruption to on-going workflows, you need to check your scripts."
        },
        {
          "date": "26 March 2021",
          "title": "IBM Cloud Code Engine is supported as an app deployment type",
          "description": "IBM Cloud Code Engine is now supported as an application deployment type when you use a starter kit in the IBM Cloud console. Code Engine is a fully managed, serverless platform that runs your containerized workloads, including web apps, micro-services, event-driven functions, or batch jobs. The Code Engine experience is designed so that you can focus on writing code and not on the infrastructure that is needed to host it."
        }
      ]
    }
  }
