{
    "title": "IBM Cloud overview docs",
    "lastupdated": "2021-05-19",
    "introduction": "The platform is built to support your needs whether it's working only in the public cloud or taking advantage of a multicloud deployment model. Leverage the docs, API & SDK reference, architecture references, and more to support your app development needs.",
    "section_devtools": {
      "api": "/docs?tab=api-docs&category=platform_services",
      "cli": "/docs?tab=develop",
      "terraform": "https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs"
    },
    "section_recommended": [
      {
        "title": "What's included in the platform?",
        "description": "The platform consists of a network of interrelated components that work together to provide a consistent and dependable cloud experience to support your app development needs.",
        "href": "/docs/overview?topic=overview-whatis-platform#built-into-platform"
      },
      {
        "title": "Try out IBM Cloud, for free",
        "description": "Get up and running quickly by setting up a Lite account with this short tutorial.",
        "href": "/docs/overview?topic=overview-tutorial-try-for-free"
      },
      {
        "title": "Service and infrastructure by location",
        "description": "Check out the regions and data centers that IBM Cloud products are available.",
        "href": "/docs/overview?topic=overview-services_region"
      }
    ],
    "section_videos": [
      {
        "title": "Learn how to navigate through the IBM Cloud console",
        "href": "/docs/overview?topic=overview-ui#video-ui",
        "thumbnail": "/images/welcome-thumbnail.png"
      }
    ],
    "section_learn": {
      "developer": "https://developer.ibm.com/depmodels/cloud/",
      "architecture": "https://www.ibm.com/cloud/architecture",
      "training": "https://www.ibm.com/training/cloud",
      "community": "https://community.ibm.com/community/user/publiccloud/home"
    },
    "section_updates": {
      "view_more": "/docs/overview?topic=overview-whatsnew",
      "tiles": [
        {
          "date": "07 May 2021",
          "title": "Support for third-party virtual server images with Terraform",
          "description": "Third-party providers can now offer virtual server images deployed by using Terraform in IBM Cloud. This capability is supported by the beta release of IBM Cloud Partner Center and our previously general availability release of private catalog capabilities."
        },
        {
          "date": "21 April 2021",
          "title": "Delivering notifications by using webhooks",
          "description": "You can now easily add webhooks to the notification distribution list in addition to adding email addresses. You can register a webhook with your account on the Notification distribution list page to receive all account notifications."
        },
        {
          "date": "19 April 2021",
          "title": "Upcoming changes to the user invitation flow",
          "description": "Starting 01 June 2021, to enhance security and user protection, all users will be required to accept an invitation to become an active user within a new account. The new invitation flow will have an impact only on inviting existing IBM Cloud users. Concerned about how this change will impact your automation? To avoid any disruption to on-going workflows, you need to check your scripts."
        }
      ]
    }
  }
